app/controllers/sessions_controller.rb

	def new
		@user = User.find_or_create_from_auth_hash(auth_hash)
---
SELECT  "users".* FROM "users" WHERE "users"."auth_hash" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]